/*
 1. Построить шаблонный класс, который будет описывать элемент хранимых данных, доступ к ним, сравнение элементов и т.п. по необходимости.
2. Построить контейнерный шаблонный класс операций над элементами данных, включающий операции:
	добавления;       -Done
	удаления;           -Done
	поиска;             -Done
	просмотра;          -Done
	сортировки элементов;  -Done
	перестановки элементов в обратном порядке;        -Done
	замены всех подобных элементов по заданному ключу;   -Done
	поиска максимального элемента;                    -Done   
	остальные функции добавлять по необходимости.
3.	Для данного контейнерного класса предусмотреть при формировании элемента задание режима уникальных элементов (т.е. проверку на дублирование значений элементов).
4. Для обработки всех ошибочных ситуаций использовать конструкцию try…catch().
4.	Дополнительно к контейнеру рекомендуется реализовать класс-итератор.
5. В Main создать три экземпляра шаблонного класса-контейнера для разных типов данных. Работа с этими объектами должна демонстрироваться на следующих операциях: добавить – просмотреть – найти – удалить – найти – просмотреть. 
6. Отладить и выполнить полученную программу. Проверить обработку исключительных 

 7.     Кольцо двусвязное.
 
 */