/*– Согласно варианта описать объект с помощью класса. В нем должно быть не менее трех полей(свойств), желательно, разных типов. 
	Создать класс, который будет реализовывать:
1.	Метод для создания массива объектов.             - Done
2.	Метод для заполнения массива объектами.          - Done
3.	Метод для вывода массива объектов на экран.      - Done
4.	Метод для удаления экземпляра класса из массива. - Done
5.	Метод для добавления экземпляра класса в массив. - Done
	Реализовать консольное меню, для проверки функционала.
	В качестве типа одного из полей класса использовать enum (например, для цвета).
*/