/*1.	Реализовать интерфейс, который будет расширять предметную область из предыдущих лабораторных работ. Добавить в интерфейс:
    	метод вывода на экран всех полей класса;
    	свойство содержащее название объекта;
    	метод, который делает реверс названия объекта.
2.	Добавить в интерфейс для одного из методов реализацию по умолчанию.
3.	Реализовать интерфейс всеми классами потомками, которые находятся в самом низу иерархии наследования.
4.	Добавить в программу любой класс, который будет реализовывать интерфейс.
5.	В главном классе создать метод, который будет создавать экземпляр класса из стандартной библиотеки коллекции, в качестве типа хранимых объектов использовать тип интерфейса.
6.	Вывести на экран все элементы коллекции, затем сделать реверс названий объектов и повторить операцию.
7.	Для обработки всех ошибочных ситуаций использовать конструкцию try…catch().*/

